/**
 * Решает задачу. Cоздать класс Decode.java, который принимает через System.in режим работы (0 —
 * кодирование, 1 — декодирование). Если выбран режим декодирования, то программа должна принимать
 * из System.in разделенные пробелом двухсимвольные строки и выдавать в System.out декодированные
 * символы, разделенные также пробелом. При кодировании выполняется обратная операция. Подзадачи
 * кодирования и декодирования должны быть выделены в отдельные методы. Обратить внимание на ASCII
 * таблицу. В случае любой ошибки выводить "error".
 *
 * @author MaxDSC
 */
package maxdsc.quests.encrypt;
