/**
 * Решает задачу. Создать класс Functions.java, который рассчитывает и выводит на экран таблицу из
 * трех функций: Верзьера Аньези с единичным диаметром, Лемниската Бернулли с единичным интервалом в
 * положительной полуплоскости (Y > 0) и квадратичную гиперболу. В первом столбце перечисляются
 * значения абсциссы от минус Пи до плюс Пи включительно, должно быть 42 замера на этом интервале.
 * Второй, третьй и четвертый столбцы описывают значения функций в точке. Заголовки таблицы не
 * нужны. Все значения записываются с точностью до 7 знаков после запятой, необходимо использовать
 * тип double для повышенной точности. Разделитель между столбцами — " | ". Всего должно быть ровно
 * 42 записи в таблице. Результат работы программы нужно разместить в файле
 * src/main/resources/data.txt (запись в файл из программы реализовывать не нужно, можно
 * использовать перенаправление вывода). В случае, если функция не определена в какой-либо точке, в
 * таблице должен быть знак "-".
 *
 * @author MaxDSC
 */
package maxdsc.quests.func;
